OpenFOAM-v1806/tutorials/lagrangian/reactingParcelFoam/cylinder/Allrun.pre
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

restore0Dir
runApplication blockMesh

#runApplication setSet -batch wallFilmRegion.setSet
runApplication topoSet

runApplication extrudeToRegionMesh -overwrite

paraFoam -touch
paraFoam -touch -region wallFilmRegion

#------------------------------------------------------------------------------
